content/post/how-do-you-write-good-blog-posts.md
+++
title = "How Exactly Do You Write Good Blog Posts?"
author = ["Rafael Nicdao"]
tags = ["meta"]
draft = false
date = 2021-07-09
pin = true
summary = "A blog post on how to write good blog posts"
+++

## Key Points {#key-points}


### Be concise; optimize for reading {#be-concise-optimize-for-reading}

You might write and/or edit a blog post once, twice or even 5x but ...

... in comparison your readers might read it tens, hundreds or even thousands of times (suppose it got popular).


### Know who your target readers area; empathise with them {#know-who-your-target-readers-area-empathise-with-them}

For example:

Instead of writing "medical jargon-filled" posts with the intention of targeting medical-laymen readers...

... try using analogies that you think might resonate with the _average_ person


### Examples help {#examples-help}

Descriptions and definitions can sometimes be too _abstract_ for the reader to fully grasp.

For example:

> The sorites paradox is a paradox that arises from vague predicates

**What?!** Ok, here's an example:

> 1 grain of wheat does not make a heap.
> If 1 grain doesn't make a heap, then 2 grains don't.
> If 2 grains don't make a heap, then 3 grains don't.
> ...
> If 999,999 grains don't make a heap, then 1 million grains don't.
